Tekla Open API Reference for Tekla Structures 2025
OBB.Intersects Method (Line)
 Tests if current OBB intersects with the given Line
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Intersects(
	Line line
)
Public Function Intersects (
	line As Line
) As Boolean
Parameters
line
Type: Tekla.Structures.Geometry3d.Line
Line to test against
Return Value
Type: Boolean
True if the OBB intersects with the given Line, otherwise false
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the line parameter.
See Also
Reference
OBB Class
Intersects Overload
Tekla.Structures.Geometry3d Namespace